import React from 'react';
import styles from './Terms.module.scss';
import Title from '../../components/Title';
import { Link } from 'react-router-dom';
import { ROUTES } from '../../constants';

const Terms = () => {
  return (
    <div className={styles.container}>
      <Title className={styles.title}>
        Умови використання сайту Благодійної організації «Благодійний фонд «ГЕНЕЗИС ДЛЯ УКРАЇНИ»
      </Title>
      <p className={styles.text}>
        Просимо ознайомитися з цими Умовами використання сайту{' '}
        <span className={styles.bold}>
          Благодійної організації «Благодійний фонд «ГЕНЕЗИС ДЛЯ УКРАЇНИ»
        </span>{' '}
        ( далі - Умови) перед користуванням cайтом{' '}
        <a href="https://genesis-for-ukraine.com" className={styles.link}>
          https://genesis-for-ukraine.com
        </a>{' '}
        (далі - Сайт). Ці Умови містять інформацію щодо прав та обов’язків користувачів Сайту.
      </p>
      <p className={styles.text}>
        Подальшим використанням Сайту, Ви підтверджуєте своє ознайомлення з цими Умовами, розуміння їх змісту і
        зобов’язання дотримуватися та виконувати ці Умови у повному обсязі. Якщо ви не погоджуєтеся з цими Умовами, будь
        ласка, припиніть використання Сайту.
      </p>
      <p className={styles.text}>
        <span className={styles.bold}>Благодійна організація «Благодійний фонд «ГЕНЕЗИС ДЛЯ УКРАЇНИ»</span>
        , ідентифікаційний код 44801563, місцезнаходження: Україна, 04080, м. Київ, вул. Кирилівська, 40-Р (далі – БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ»), є неприбутковою організацією, яка здійснює благодійну діяльність, у тому числі, за допомогою Сайту. Далі за текстом на позначення БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ» можуть використовуватись також позначення «Фонд», «Організація», «ми», «наш» «нас» та інші релевантні займенники.
      </p>
      <p className={styles.text}>
        Збір, обробка, використання та зберігання персональних даних у зв’язку з використанням вами Сайту здійснюються відповідно до чинного законодавства та {' '}
        <Link to={ROUTES.POLICY} className={styles.link}>
          Політики приватності
        </Link>
        .
      </p>
      <p className={styles.text}>
        За наявності питань та зауважень щодо цих Умов та функціонування Сайту, Ви можете викласти їх у листі, надіславши його на електронну пошту{' '}
        <a href="mailto:charity.fund@gen.tech" className={styles.link}>
          charity.fund@gen.tech
        </a>
        .
      </p>
      <h3 className={styles.subtitle}>Угода</h3>
      <p className={styles.text}>
        Ці Умови та опубліковані на Сайті правила, включаючи{' '}
        <Link to={ROUTES.POLICY} className={styles.link}>
          {' '}
          Політику приватності
        </Link>
        , є договором між користувачем Сайту і БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ», що регулює порядок використання Сайту та збору благодійних пожертв за допомогою Сайту.
      </p>
      <ul className={styles.list}>
        Використовуючи Сайт, користувач заявляє та підтверджує, що:
        <li>
          відповідно до законодавства країни користувача він/вона має цивільну дієздатність та має право укладати цю угоду;
        </li>
        <li>законодавство країни користувача не обмежує користувача у використанні Сайту;</li>
        <li>користувач дотримується цих Умов та відповідних вимог законодавства;</li>
        <li>благодійний внесок є добровільним та не підлягає поверненню;</li>
        <li>користувач, який вніс благодійний внесок або іншим чином допоміг Фонду дає безумовну згоду на перерозподіл та/або використання благодійного внеску в інших напрямках діяльності Фонду.</li>
      </ul>
      <h3 className={styles.subtitle}>Напрямки діяльності БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ»</h3>
      <p className={styles.text}>
        Сайт БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ» призначений для користувачів, які бажають зробити благодійний внесок або іншим чином допомогти Фонду.
      </p>
      <p className={styles.text}>
        Благодійна організація «Благодійний фонд «ГЕНЕЗИС ДЛЯ УКРАЇНИ» веде свою діяльність з метою надання допомоги Збройним Силам України, іншим військовим формуванням, правоохоронним (спеціальним) органам, органам цивільного захисту, добровольчим формуванням територіальних громад, іншим особам, які забезпечують національну безпеку і оборону, відсіч і стримування збройної агресії іноземної держави, а також особам, які постраждали чи можуть постраждати від такої збройної агресії.
      </p>
      <p className={styles.text}>
        Сайт призначений для користувачів, які бажають зробити благодійний внесок (далі – Донори) або іншим чином допомогти Фонду (далі - Волонтери).
      </p>
      <h3 className={styles.subtitle}>Чим допомогти?</h3>
      <p className={styles.text}>
        За допомогою Сайту користувачі можуть робити благодійні внески на користь Фонду, який використовує їх за
        вказаними напрямками своєї діяльності. За бажанням, користувач може вказати цільове призначення свого внеску
        серед програм (проєктів) оголошених Фондом. За списком програм (проєктів) з їх описом, метою, сумою та
        тривалістю реалізації, користувач може звернутися із відповідним запитом на електронну пошту Фонду <a
        className={styles.link} href="mailto: charity.fund@gen.tech">
        charity.fund@gen.tech{' '}</a>. Залишок невикористаних коштів, які були отримані від користувача, у вигляді цільового благодійного внеску можуть бути використані в інших напрямках діяльності Фонду без попереднього погодження порядку їх використання з користувачем. У випадку неможливої реалізації цільового призначення благодійного внеску кошти будуть використані в інших напрямках діяльності Фонду в межах Статутної діяльності Фонду без попереднього погодження порядку використання коштів з користувачем.
      </p>
      <ul className={styles.list}>
        Способи внесення допомоги:
        <li>одноразовий платіж;</li>
        <li>підписка, яка передбачає щомісячні/ щорічні платежі у довільній сумі.</li>
      </ul>
      <p className={styles.text}>
        Вказана підписка може бути скасована у будь-який момент через сервіси банку користувача (наприклад, Приват24).
      </p>
      <p className={styles.text}>
        Для отримання індивідуального звіту про використання Фондом благодійних внесків користувач може звернутися із відповідним запитом на електронну пошту Фонду {' '}
        <a href="mailto:charity.fund@gen.tech" className={styles.link}>
          charity.fund@gen.tech
        </a>
        . Звіти також публікуються Фондом у порядку передбаченому чинним законодавством.
      </p>
      <p className={styles.text}>
        Звертаємо увагу, що платежі через Сайт забезпечуються шляхом перерахування коштів на рахунок Фонду за допомогою платіжних систем Visa та MasterCard або іншим провайдером платіжних послуг, що знаходиться поза контролем Фонду, а саме LiqPay. Після переходу за посиланням для оплати за допомогою LiqPay, користувач зобов’язаний дотримуватися умов використання, політики конфіденційності та інших політик такого провайдера. Фонд не несе відповідальності за платіжні дані, обробку яких здійснює провайдер.
      </p>
      <p className={styles.text}>
        Для переказу благодійного внеску через Сайт, користувач зобов’язаний надавати необхідну інформацію про себе. Обробка персональних даних користувачів здійснюється відповідно {' '}
        <Link to={ROUTES.POLICY} className={styles.link}>
          {' '}
          Політики приватності
        </Link>
      </p>
      <h3 className={styles.subtitle}>Волонтери</h3>
      <p className={styles.text}>
        Фонд радо прийме допомогу не тільки у вигляді фінансування, але і у вигляді волонтерства. Для цього заповніть, будь ласка, анкету на Сайті та оберіть один із запропонованих видів допомоги. Наш координатор зв’яжеться з вами за вказаними контактними даними і розповість, як і коли ви можете допомогти Фонду у здійсненні його діяльності.
      </p>
      <p className={styles.text}>
        За вашою вимогою, Фонд укладе з Вами відповідний договір про провадження волонтерської діяльності.
      </p>
      <h3 className={styles.subtitle}>Сторонні сервіси та веб-сайти</h3>
      <p className={styles.text}>
        Деякі функції Сайту, наприклад здійснення благодійного платежу, передбачають використання сторонніх сервісів і сайтів, які знаходяться поза контролем Фонду.
      </p>
      <p className={styles.text}>
        У випадку виникнення проблем Фонд докладе максимум зусиль для їх вирішення. Однак Фонд не несе відповідальності за контент та функціонал, які можуть пропонуватися на таких сайтах або такими сторонніми сервісами, а також за будь-які збитки, шкоду або інші грошові зобов’язання, що виникли в результаті використання користувачами таких сторонніх сайтів або сервісів.
      </p>
      <p className={styles.text}>
        <span className={styles.bold}>Важливо! Використання сторонніх сайтів та сервісів, застосування інших умов використання та політик приватності.</span> Фонд не несе відповідальності за збір, обробку та зберігання персональних даних сторонніми сайтами та сервісами.
      </p>
      <h3 className={styles.subtitle}>Контент та інтелектуальна власність</h3>
      <p className={styles.text}>
        Сайт належить і контролюється Фондом. Усі матеріали Сайту, включаючи тексти, зображення, дизайн, графіку, інформацію, логотипи, аудіо- та відеозаписи, інтерфейси, програмне забезпечення, торговельні марки, комерційні найменування та інші (далі - Контент), а також авторські та інші права інтелектуальної власності на такий Контент належать Фонду або розміщені зі згоди їх правовласника.
      </p>
      <p className={styles.text}>
        Заборонено використовувати Контент, або будь-які його елементи, без попереднього письмового дозволу Фонду або відповідних власників будь-яким чином, не передбаченим цими Умовами.
      </p>
      <p className={styles.text}>
        У результаті завантаження або створення копій Контенту, у користувача не виникає жодних прав на такий Контент. Користувач не вправі відтворювати, публікувати, передавати, поширювати, змінювати, створювати похідні твори чи іншим чином використовувати Контент з комерційною метою або метою, що суперечить законодавству, без попереднього письмового дозволу Фонду. Користувачі не вправі змінювати та/або видаляти будь-які повідомлення про право інтелектуальної власності з матеріалів, завантажених чи роздрукованих із Сайту.
      </p>
      <p className={styles.text}>
        Фонд може змінювати умови та/або припинити доступ користувачів до Контенту в будь-який час та з будь-якої причини без попереднього повідомлення.
      </p>
      <h3 className={styles.subtitle}>Відмова від гарантій та обмеження відповідальності</h3>
      <p className={styles.text}>
        Сайт БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ» надається в користування на умовах, вказаних на Сайті. Якщо інше не передбачено цими Умовами або іншими політиками на Сайті, Фонд відмовляється від усіх гарантій, у максимально допустимих законодавством межах, стосовно Сайту, його функціоналу та контенту.
      </p>
      <p className={styles.text}>
        Фонд несе відповідальність за використання благодійних внесків відповідно до чинного законодавства України.
      </p>
      <p className={styles.text}>
        Однак Фонд не бере на себе жодних зобов’язань та не дає жодних гарантій, зокрема, щодо точності, корисності, надійності та коректності роботи Сайту. Фонд не гарантує, що робота Сайту буде безперервною або безпечною, що будь-які дефекти будуть виправлені або що Сайт не містить вірусів або інших шкідливих елементів.

      </p>
      <p className={styles.text}>
        Фонд не несе відповідальності, якщо будь-яка інформація, матеріали, контент, доступні через Сайт, є неточними або неповними, а також за типографічні помилки або недоліки в тексті або інших матеріалах.
      </p>
      <p className={styles.text}>
        В жодному разі Фонд, його засновники, співробітники, підрядники або волонтери не несуть відповідальності за прямі, опосередковані, випадкові, спеціальні, присуджені та побічні збитки, пов’язані з використанням або неможливістю використання Сайту, включаючи, крім іншого, будь-які збитки, які виникли в результаті помилок, упущень і перебоїв в роботі, дефектів, вірусів, навіть якщо Фонд був повідомлений про можливість таких збитків.
      </p>
      <p className={styles.text}>
        Вищевикладені положення щодо відмови від гарантій та обмеження відповідальності застосовуються в обсязі, максимально допустимому застосовним законодавством.
      </p>
      <h3 className={styles.subtitle}>Відшкодування збитків</h3>
      <p className={styles.text}>
        Користувач погоджується у максимально допустимих чинним законодавством межах звільнити від відповідальності, відшкодувати збитки і захистити БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ», наших засновників, партнерів, співробітників, підрядників і волонтерів, від будь-яких позовів, відповідальності, шкоди, збитків і витрат, включаючи обґрунтовані юридичні та бухгалтерські витрати, будь-яким чином пов’язаних або таких, що виникають в результаті:
      </p>
      <ul className={styles.list}>
        <li>порушення користувачем будь-якого з положень цих Умов,</li>
        <li>
          використання / неналежного використання користувачем Сайту, контенту, функцій, доступних на Сайті, або
        </li>
        <li>порушення користувачем законодавства або прав третіх осіб.</li>
      </ul>
      <p className={styles.text}>
        Користувач також погоджується відшкодувати Фонду будь-які збитки і витрати, понесені Фондом (включаючи гонорари або витрати на правову допомогу, бухгалтерські послуги, професійних радників та інших експертів) у зв’язку із захистом чи врегулюванням спорів, що виникли через використання користувачем Сайту для будь-яких протизаконних або заборонених цілей.
      </p>
      <p className={styles.text}>
        Фонд залишає за собою право обирати способи юридичного захисту, які вважатиме за потрібне, включаючи випадки, в яких користувач звільняє Фонд від відповідальності. Тому користувач надає згоду на співпрацю з Фондом в реалізації стратегії захисту Фондом своїх прав та інтересів.
      </p>
      <h3 className={styles.subtitle}>Застосовне право і вирішення спорів</h3>
      <p className={styles.text}>
        За винятком випадків, передбачених цими Умовами чи будь-якими іншими політиками, ці Умови написані та тлумачиться відповідно до законодавства України.
      </p>
      <p className={styles.text}>
        Якщо будь-який матеріал на Сайті або використання Сайту користувачем суперечить чинному законодавству країни знаходження користувача, Сайт не призначений для використання таким користувачем, і ми просимо вас його не використовувати. Користувач у повному обсязі несе відповідальність за ознайомлення із законами своєї юрисдикції та їх дотримання.
      </p>
      <p className={styles.text}>
        Будь-який спір, конфлікт, вимога чи суперечка, що прямо чи опосередковано пов’язані з Сайтом чи цими Умовами, зокрема, їх дійсності, тлумачення чи застосування, повинні вирішуватися шляхом переговорів безпосередньо з командою БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ» відповідно до принципів добросовісності та співпраці. Якщо переговорний спосіб виявиться неефективним у досягненні згоди, суперечка повинна вирішуватись виключно в судах України, з дотриманням правил підсудності, відповідно до чинного законодавства України.
      </p>
      <p className={styles.text}>
        Всі претензії повинні бути пред’явлені протягом одного (1) року з моменту їх виникнення, за винятком випадків, коли застосовне законодавство вимагає більш тривалого строку.
      </p>
      <h3 className={styles.subtitle}>Електронні повідомлення</h3>
      <p className={styles.text}>
        Надаючи нам свою електронну пошту через Сайт, ви розумієте і погоджуєтеся з тим, що ми можемо надсилати вам повідомлення на вказані вами контактні дані, зокрема,
      </p>
      <ul className={styles.list}>
        <li>повідомлення про оновлення на Сайті;</li>
        <li>
          інформацію або матеріали, що стосуються користування Сайтом, здійснення благодійних внесків та їх використання, запитів щодо волонтерства;
        </li>
        <li>інформацію щодо оновлення цих Умов.</li>
      </ul>
      <p className={styles.text}>
        У вас є можливість відмовитися від отримання таких електронних повідомлень, виконавши інструкції, наведені в таких повідомленнях.
      </p>
      <h3 className={styles.subtitle}>Інші умови</h3>
      <p className={styles.text}>
        Якщо будь-яке з положень цих Умов буде визнано незаконним, недійсним або не застосовним, інші положення цих Умов залишатимуться в силі і підлягатимуть виконанню. Фонд вправі без згоди користувача передати свої права та обов’язки за цими Умовами третій особі, але це не впливатиме на права користувача та/або зобов’язання Фонду за цією Угодою.
      </p>
      <p className={styles.text}>
        Друкована версія цих Умов є допустимим доказом у провадженні, яке виникло на підставі або у зв’язку з використанням Сайту, в тій же мірі і на тих же умовах, що й інші документи і записи, що були створені і зберігаються у друкованому вигляді.
      </p>
      <p className={styles.text}>
        Фонд залишає за собою право в будь-який час вносити зміни до цих Умов. При цьому Фонд не зобов’язаний повідомляти користувачів про такі зміни.
      </p>
      <h3 className={styles.subtitle}>Контактні дані</h3>
      <p className={styles.text}>
        Якщо у вас є питання або коментарі з приводу цих Умов, Сайту або діяльності Фонду, будь ласка, зв’яжіться з нами: 04080, м.Київ, вул. Кирилівська, 40-Р;
      </p>
      <p className={styles.text}>
        <a className={styles.link} href="tel:+38 063 417 04 77">
          +38 063 417 04 77;
        </a>
      </p>
      <p className={styles.text}>
        <a className={styles.link} href="mailto: charity.fund@gen.tech">
          charity.fund@gen.tech.{' '}
        </a>
      </p>
    </div>
  );
};

export default Terms;
