export const aboutGatheringListItem = [
  {
    id: 0,
    text: 'Забезпечувати розвідувальні операції. Замість виходів бійців «за нуль» — вильоти дронів. Коптери ефективно виявлятимуть ворогів, зберігаючи життя та здоров’я військових.',
  },
  {
    id: 1,
    text: 'Шукати цілевказання для нашої артилерії.',
  },
  {
    id: 2,
    text: 'Коригувати вогонь по ворожій техніці та живій силі в режимі реального часу.',
  },
  {
    id: 3,
    text: 'Шукати поранених, а також шляхи для підвозу їжі, води й боєприпасів.',
  }
]
