export const accordionAnswers = [
  {
    id: 1,
    title: 'Які підрозділи ми забезпечили?',
    content: (
      <p>
        Ми забезпечили чотири бригади Сил територіальної оборони ЗСУ повноцінними комплектами для
        аеророзвідки. Зокрема, 112, 114 та 241 бригади, які сформувалися в Києві та Київській
        області та виконують зараз бойові завдання на сході та півдні країни. Номер четвертої
        бригади поки не розголошується в якості сюрприза для ворога. Її вдалося забезпечити
        комплектом аеророзвідки завдяки внеску однієї з партнерських компаній Genesis, яка теж
        виявила бажання підтримати ініціативу.
        <br />
        <br />У січні 2023 року Командування Сил ТрО разом із фондом «Повернись живим» та
        екосистемою Genesis запустили освітній курс «Вишкіл капітанів», де навчалися офіцери зі 112,
        114 та 241 бригад. Проєкт «Здіймемо рокіт» продовжує нашу системну співпрацю та розвиток
        лідерства у війську. Завдяки бригадним комплексам аеророзвідки командування підрозділів
        матиме необхідну розвідувальну інформацію та зможе нищити ворогів і берегти життя
        українських бійців.
      </p>
    ),
  },
  {
    id: 2,
    title: 'Чому бригадам необхідна саме ця техніка?',
    content: (
      <p>
        {' '}
        Повноцінні комплекти аеророзвідки замість окремих коптерів дадуть розвідникам змогу
        виконувати бойові завдання й не турбуватися, як і де «заживити» дрони в польових умовах, та
        як передати здобуту інформацію іншим членам групи.
        <br />
        <br />
        Крім того, до комплектів входять антени. Вони стабілізують прийом сигналу, збільшуючи
        відстань його передачі, й, відповідно, дальність дії безпілотника. У такий спосіб групи
        аеророзвідників зможуть одержувати картинку поля бою з дронів, коригувати вогонь та
        знаходити нові цілі.
      </p>
    ),
  },

  {
    id: 3,
    title: 'З чого складається один комплект для аеророзвідки?',
    content: (
      <div>
        <p>
          На старті проєкту запланований набір аеророзвідки складався з наступного переліку майна:
        </p>
        <br />
        <ol>
          <li> - Рація автомобільна — 3 шт.</li>
          <li> - Рація портативна — 12 шт.</li>
          <li> - Mavic 3T — 6 шт.</li>
          <li> - Mavic 3E — 12 шт.</li>
          <li> - Батарея до Mavic — 108 шт.</li>
          <li> - Флешка для Mavic 64 Гб — 15 шт.</li>
          <li> - Антена Alientech — 6 шт.</li>
          <li> - Зарядна станція BLUETTI 1800 Вт — 6 шт.</li>
          <li> - Ноутбук ігровий — 2 шт.</li>
          <li> - Телевізор 55" — 3 шт.</li>
          <li> - Планшет, флешка 128 Гб та підсумок — 10 шт.</li>
        </ol>
        <br />
        <p>
          Під час реалізації процесу закупівель перелік майна був оновлений відповідно до наявності
          необхідного обладнання на ринку, коливань цін та у відповідності до потреб військових.
          <br />
          Фінальний перелік майна, що було передане військовим:
        </p>
        <br />
        <ol>
          <li> - Рація автомобільна — 3 шт.</li>
          <li> - Рація портативна — 12 шт.</li>
          <li> - Mavic 3T — 6 шт.</li>
          <li> - Mavic 3 Pro FMC — 12 шт.</li>
          <li> - Батарея до Mavic — 108 шт.</li>
          <li> - Флешка для Mavic 64 Гб — 15 шт.</li>
          <li> - Антена Alientech — 6 шт.</li>
          <li> - Зарядна станція BLUETTI 1800 Вт — 6 шт.</li>
          <li> - Ноутбук ігровий — 2 шт.</li>
          <li> - Телевізор 55" — 3 шт.</li>
          <li> - Планшет (більший обсяг пам’яті замість додаткової флешки) та підсумок — 10 шт.</li>
        </ol>
      </div>
    ),
  },
];
