import React from 'react';
import styles from './Policy.module.scss';
import Title from 'src/components/Title';

const Policy = () => {
  return (
    <div className={styles.container}>
      <Title className={styles.title}>Політика приватності</Title>
      <h3 className={styles.subtitle}>
        Благодійна Організація «БЛАГОДІЙНИЙ ФОНД «ГЕНЕЗИС ДЛЯ УКРАЇНИ» турбується про захист персональних даних своїх користувачів
      </h3>
      <p className={styles.text}>
        Ця політика приватності містить інформацію щодо переліку персональних даних користувачів, які збираються, зберігаються та використовуються під час використання Сайту.
      </p>
      <ol className={styles.orderList}>
        Зміст політики приватності:
        <li>Хто ми?</li>
        <li>На що поширюється політика приватності?</li>
        <li>Перелік даних, які ми збираємо і навіщо?</li>
        <li>Який строк зберігання даних користувачів?</li>
        <li>Чи передаються дані третім особам?</li>
        <li>Чи має місце трансфер даних?</li>
        <li>Чи використовує Фонд файли cookie?</li>
        <li>Права користувачів щодо належних їм персональних даних?</li>
        <li>Який порядок оновлення політики приватності?</li>
      </ol>
      <h3 className={styles.subtitle}>1. Хто ми?</h3>
      <p className={styles.text}>
        Ми, <span className={styles.bold}>БО «БФ «ГЕНЕЗИС ДЛЯ УКРАЇНИ»</span> - благодійна неприбуткова організація, діяльність якої спрямована на сприяння обороноздатності та мобілізаційній готовності країни, захисту населення у надзвичайних ситуаціях мирного і воєнного стану.
      </p>
      <p className={styles.text}>
        <span className={styles.bold}>Контакти:</span>
      </p>
      <p className={styles.text}>04080, м.Київ, вул. Кирилівська, 40-Р;</p>
      <p className={styles.text}>
        <a href="tel:+38 063 417 04 77" className={styles.link}>
          +38 063 417 04 77;
        </a>
      </p>
      <p className={styles.text}>
        <a href="mailto:charity.fund@gen.tech. " className={styles.link}>
          charity.fund@gen.tech
        </a>
        .
      </p>
      <p className={styles.text}>
        За наявності будь-яких питань та зауважень Ви можете звернутися за вказаними вище контактами.
      </p>
      <h3 className={styles.subtitle}>2. На що поширюється політикаприватності?</h3>
      <p className={styles.text}>
        Ця політика приватності поширюється на Сайт Фонду{' '}
        <a href="https://genesis-for-ukraine.com" className={styles.link}>
          https://genesis-for-ukraine.com
        </a>
      </p>
      <h3 className={styles.subtitle}>3. Перелік даних, які ми збираємо і навіщо?</h3>
      <p className={styles.text}>
        Фонд збирає такі категорії даних: технічну інформацію і дані, що надаються користувачем та волонтером.
      </p>
      <p className={styles.text}>
        Технічна інформація - IP адреса, геолокація, тип пристрою і тип браузера, файли cookie і дані про взаємодію користувача з сайтом – сесійний ID (взаємодія з сайтом, назва сайту, з якого виконаний перехід на Сайт, використовувані користувачем функції, використані сторінки на Сайті Фонду, спосіб використання Сайту і дії, як, якщо такі дії присутні). Вказані дані збираються автоматично при переході на Сайт.
      </p>
      <p className={styles.text}>
        Причина збору: робота, аналітика, підтримка і поліпшення Сайту.
      </p>
      <p className={styles.text}>
        Дані, що надаються користувачем: лише технічні дані.
      </p>
      <p className={styles.text}>
        Дані, що надаються волонтером: прізвище, ім’я, номер телефону або месенджера, сторінка у Facebook та електронна пошта.
      </p>
      <p className={styles.text}>
        Причина збору: Виконання наших статутних цілей; Комунікація між Сайтом та користувачем.
      </p>
      <p className={styles.text}>
        Дані, які збираються автоматично: файли cookie; технічна інформація.
      </p>
      <p className={styles.text}>
        Звертаємо увагу, що ми свідомо не обробляємо персональні дані користувачів молодше 16-ти років. Якщо Ви є таким користувачем, або ж законним представником такого користувача, будь-ласка повідомте нас листом на електронну пошту{' '}
        <a href="mailto:charity.fund@gen.tech" className={styles.link}>
          charity.fund@gen.tech
        </a>
      </p>
      <h3 className={styles.subtitle}>4. Який строк зберігання даних користувачів?</h3>
      <p className={styles.text}>
        Фонд зберігає персональні дані протягом 24 місяців. Користувач може скористатися своїм правом на видалення своїх даних шляхом направлення відповідного запиту. Дані такого користувача будуть видалені з наших серверів протягом 30 днів після надходження такого запиту
      </p>
      <h3 className={styles.subtitle}>5. Чи передаються дані третім особам?</h3>
      <p className={styles.text}>
        Персональні дані використовуються виключно з метою контакту між Фондом і користувачем. Ми не плануємо передавати ваші персональні дані третім особам. У разі необхідності передачі даних користувачів, така передача здійснюється за згодою відповідного користувача. Виключення становлять випадки, коли така передача зумовлена положеннями законодавства та/ або необхідна для виконання статутних цілей Фонду.
      </p>
      <h3 className={styles.subtitle}>
        6. Чи має місце трансфер даних за межі Європейської Економічної Зони?
      </h3>
      <p className={styles.text}>
        При виникненні необхідності трансферу Фонд застосовує необхідні засоби захисту даних. У разі необхідності трансферу даних користувачів, такий трансфер здійснюється за згодою відповідного користувача. Винятки становлять випадки, коли такий трансфер зумовлений положеннями законодавства та/ або необхідна для виконання статутних цілей Фонду.
      </p>
      <h3 className={styles.subtitle}>7. Чи використовує Фонд файли cookie?</h3>
      <p className={styles.text}>
        Ми використовуємо файли cookie, необхідні для функціонування сайту. За допомогою файлів cookie ми отримуємо таку інформацію: IP адреса, геолокація, тип пристрою і тип браузера, персональний ID для моніторингу сесії користувача на Сайті, дані про час взаємодії з Сайтом, а також інформацію про взаємодію користувача з сайтом.
      </p>
      <p className={styles.text}>
        Файли cookie можна відключити за допомогою налаштувань Вашого браузера. Інструкції з управління налаштуваннями вашого браузера можна знайти за посиланнями:
      </p>
      <ul className={styles.list}>
        <li>Internet Explorer</li>
        <li>Firefox</li>
        <li>Safari</li>
        <li>Microsoft Edge</li>
        <li>Chrome</li>
        <li>Opera</li>
        <li>Vivaldi</li>
      </ul>
      <h3 className={styles.subtitle}>8. Права користувачів щодо належних їм персональних даних?</h3>
      <ul className={styles.list}>
        Права суб'єктів персональних даних:
        <li>
          право на доступ до інформації (отримувати пояснення щодо обробки персональних даних);
        </li>
        <li>
          право на портативність (подавати запити щодо всіх наданих нам даних та запити на передачу даних іншому їх контролеру);
        </li>
        <li>
          право на обмеження обробки (право частково або повністю заборонити обробляти персональні дані);
        </li>
        <li>право скаржитися (право подати скаргу порядку передбаченому законодавством);</li>
        <li>
          право на зміну та/ або видалення інформації (направити запит про зміну або видалення персональних даних користувача з наших систем).
        </li>
      </ul>
      <p className={styles.text}>
        Для реалізації своїх прав Ви можете звернутися з листом за адресою{' '}
        <a href="mailto:charity.fund@gen.tech" className={styles.link}>
          charity.fund@gen.tech
        </a>
        .
      </p>
      <p className={styles.text}>
        Якщо запит не був задоволений, користувач вправі скаржитись у порядку передбаченому законодавством.
      </p>
      <h3 className={styles.subtitle}>9. Який порядок оновлення політики приватності?</h3>
      <p className={styles.text}>
        Ця політика приватності і правовідносини, що потрапляють під її дію регулюються Законом України “Про захист персональних даних”.
      </p>
      <p className={styles.text}>
        Законодавство і вимоги щодо порядку збору, обробки та зберігання персональних даних можуть бути змінені. Політика приватності підлягає змінам з метою приведення її у відповідність чинному законодавству про захист персональних даних.
      </p>
    </div>
  );
};

export default Policy;
